In [27]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from sklearn import tree

from random import *

%matplotlib inline

### Import training data

In [8]:
my_data = pd.read_csv('titanic_trainer_cleaned_02.csv', delimiter=',')

In [9]:
my_data.head()

   PassengerId  Survived  Pclass  Sex   Age     Fare  Cabin
0           24         1       1    1  28.0  35.5000    1.0
1           97         0       1    1  71.0  34.6542    1.0
2          175         0       1    1  56.0  30.6958    1.0
3          186         0       1    1   NaN  50.0000    1.0
4          210         1       1    1  40.0  31.0000    1.0

### Add missing age data with mean age

In [10]:
my_data = my_data.fillna(my_data["Age"].mean())

In [11]:
my_data.head()

   PassengerId  Survived  Pclass  Sex        Age     Fare  Cabin
0           24         1       1    1  28.000000  35.5000    1.0
1           97         0       1    1  71.000000  34.6542    1.0
2          175         0       1    1  56.000000  30.6958    1.0
3          186         0       1    1  29.699118  50.0000    1.0
4          210         1       1    1  40.000000  31.0000    1.0

In [79]:
training_set = []

for i in range(20):
    training_set.append(randint(1, my_data.shape[0]-20))

# Catch any doubles
training_set = set(training_set)
training_set = list(training_set)

#training_set = pd.DataFrame(training_set)

In [85]:
survivors  = my_data['Survived']

for i in range(len(training_set)):
    survivors.drop(survivors.index[training_set[i]])
    #print (training_set[i])
survivors.head()

0    1
1    0
2    0
3    0
4    1
Name: Survived, dtype: int64

In [77]:
training_target = np.delete(survivors,training_set)

ValueError: Wrong number of items passed 871, placement implies 891

### Build Classifier

In [13]:
my_data_labels.head()

0    1
1    0
2    0
3    0
4    1
Name: Survived, dtype: int64

In [15]:
my_data_features = my_data[["Pclass", "Age", "Sex", "Fare", "Cabin"]]
my_data_features.head()

   Pclass        Age  Sex     Fare  Cabin
0       1  28.000000    1  35.5000    1.0
1       1  71.000000    1  34.6542    1.0
2       1  56.000000    1  30.6958    1.0
3       1  29.699118    1  50.0000    1.0
4       1  40.000000    1  31.0000    1.0

In [16]:
clf = tree.DecisionTreeClassifier()

In [17]:
clf = clf.fit(my_data_features, my_data_labels)

### Import test data

In [18]:
test_data = pd.read_csv('test.csv', delimiter=',')

In [19]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_simplified
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,NaN
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,NaN
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,NaN
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,NaN

### Clean test data

In [23]:
test_data = test_data.replace("female",0)